<?php
// в дореформенную орфографию

const ABIG = 'ЁЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮѢѴІѲ';    // весь алфавит прописными
//const AKUT = "\{\{[Аа]кут\d?\}\}|[́ˊ]"; // ударения
//const AKUT = "́ˊ"; // ударения
//const WORD = "\b(?:[-\w]|".AKUT.")+\b"; // слово
const WORD = "\b(?:[-\ẃˊ]+)\b"; // слово
const S = 'цкнгшщзхфвпрлджчсмтб';                    // согласные буквы, кроме 'ьъ'
const G = 'ёЁеуыаоэяиюѣѢѵѴіІ';                        // гласные
const A = 'ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ';    // весь алфавит
const PR = '(?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?'; // приставки
//$excl = "(?<!tsd[ls]\|\b.*?)"; // исключать слова в шаблонах. вставить в начало правило замены

require "regexps.php";


$replaces_er_postfix = array (
	// ъ в конце слов после согласных
	'([цкнгшщзхфвпрлджчсмтб])([][\s.,?!:;\'"() *<]+|-то)(?! */>)' => "$1ъ$2",
	"([цкнгшщзхфвпрлджчсмтб])ъ([\s']*\.[\s']*)(</small|[{(]*(?:[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ-]|tsdl|[Вв]ики))" => "$1$2$3",
	"([".S."])(\.)( *\{\{tsdbr)" => "$1ъ$2$3",

	//"([".S."])\b(?!\.)"                        => "$1ъ",
		//"([".S."])([][\s.,?!:;'\"() *<]+|-то)(?! */>)" => "$1ъ$2",
	//"([".S."])(\.\s*)(?!['\s]*</small|['{(]*[".A."])" => "$1ъ$2",  // перед точкой в конце текста
	////"([".$s."])(\.) *$~ui" => "$1ъ$2", // перед точкой в конце текста
	//	"([".S."])ъ([\s']*\.[\s']*)(</small|[{(']*(?:[".A."-]|tsdl|[Вв]ики))" => "$1$2$3", // исключения ъ и перед точками (в конце предложений), за исключением что это сокращение. Сокращение определяется: если за словом идёт слово со строчной буквы (т.е. это не конец предложения), или слово заключено в тэг </small>.
	//	"([".S."])(\.)( *\{\{tsdbr)", "$1ъ$2$3", // в конце сикций
	'\b([Сс])([мвр])ъ\.'                           => '$1$2.', // иногда проскакивающие сокращения
	'астенъ\.'                                     => 'астен.',
	"(глаг)ъ\."                                    => "$1.",
	"(гл)ъ\."                                      => "$1.",
	"([Гг]реч)ъ\."                              => "$1.",
	"([Аа]кут)ъ"									  => "$1",
	"([Рр]аст(?:ен)?)ъ"							  => "$1",
	"(упо?трб?л?)ъ\."                              => "$1.",
	"\b([Пп]ад)ъ\."                                => "$1.",
	"\b([Рр]ед)ъ\."                               => "$1.",
	"\b([Оо]тносящ)ъ\."                            => "$1.",
	"\b([Юю]ж)н?ъ\."                               => "$1.",
	"\b(ж|м|ср|мн)ъ\."                             => "$1.",
	"\((\w?\w?[".S."])ъ\)(\w)"                 => "($1)$2",// убирание ъ внутри закрывающей скобки
	"ъ(\(|\)\w)"                                   => "$1",// исключение: перед или в скобках посреди слов ъ не ставить
	"([Ии])з-за"                                   => "$1зъ-за",// исключение: перед или в скобках посреди слов ъ не ставить
);



/*
	// окончания
	// і славянская
	$t = preg_replace("/(\w)ий(ся)?\b/u", "$1ій$2", $t);
	$t = preg_replace("/(\w)кие\b/u", "$1кіе", $t);
	$t = preg_replace("/(\w)ни([яю])\b/u", "$1ні$2", $t);
	$t = preg_replace("/(\w)и([ияе])\b/u", "$1і$2", $t);
	// ѣ
	$t = preg_replace("/(\w)еть(ся)?\b/u", "$1ѣть$2", $t);
		$t = preg_replace("/\b(п)лѣть\b/ui", "$1леть", $t);
	$t = preg_replace("/(\w)евать\b/u", "$1ѣвать", $t);
	$t = preg_replace("/(\w)енный\b/u", "$1ѣнный", $t);
	$t = preg_replace("/стве/u", "ствѣ", $t);
	$t = preg_replace("/ели([аи])\b/u", "ѣли$1", $t);
	$t = preg_replace("/евать\b/u", "ѣвать", $t);
	// ые → ыя. отключено: должно применяться при сущ. в женском роде, но не в мужском. без словаря определить род невозможно.
	//$t = preg_replace("/(\w)ые\b/u", "$1ыя", $t); ы
	// ого → аго
	$t = preg_replace("/(\w)ого(?!\{)\b/u", "$1аго", $t);
		// исключения
		$t = preg_replace("/\b(в)сякаго\b/ui", "$1сякого", $t);
		$t = preg_replace("/\b(э)таго\b/ui", "$1того", $t);
		$t = preg_replace("/\b(?<!вся)(к)аго\b/ui", "$1ого", $t);
		$t = preg_replace("/\b(м)наго\b/ui", "$1ного", $t);
		$t = preg_replace("/\b((?:от)?т)аго\b/ui", "$1ого", $t);
	//приставки
	$t = preg_replace("/(и)сс/u", "$1зс", $t);
	$t = preg_replace("/\b(р)асс/ui", "$1азс", $t);
	$t = preg_replace("/\b(б)есс/ui", "$1езс", $t);
	// ѣ
	// ѣе   - ѣ перед е
	$t = preg_replace("~(\w)е(е)\b~u", "$1ѣ$2", $t);
		$t = preg_replace("~дущѣе~u", "дущее", $t);	// иключения
		$t = preg_replace("~(домашн)ѣе~u", "$1ее", $t);
		$t = preg_replace("~(служащ)ѣе~u", "$1ее", $t);
		$t = preg_replace("~(ыросш)ѣе~u", "$1ее", $t);
		$t = preg_replace("~(п)охожѣе~u", "$1охожее", $t);
	// ѣ в конце слов после согласных
	$t = preg_replace("~([".$s."у])е(?![-{{́ˊ])\b~u", "$1ѣ", $t); // ѣ в конце слов
		// исключения
		$t = preg_replace("~\b([НнЖжСс])ѣ\b~u", "$1е", $t); // иключения
		$t = preg_replace("~\b([Чч]етыр)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~\b([Вв]ообщ)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~\b([Пп]режд)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~\b([Бб]ож)ѣ~u", "$1е", $t);
		$t = preg_replace("~([Бб]ольш)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~([Мм]еньш)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~([Лл]учш)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~([Хх]уж)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~([Тт]ож)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~([Кк]райн)ѣ~u", "$1е", $t);
		$t = preg_replace("~([Зз]адн)ѣ~u", "$1е", $t);
		$t = preg_replace("~(шевл)ѣ~u", "$1е", $t);
		$t = preg_replace("~([Оо]бщ)ѣе~u", "$1ее", $t);
		$t = preg_replace("~([с][лр][еѣ]дн)ѣ~u", "$1е", $t);
		$t = preg_replace("~\b([Ее]щ)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~\b([Уу]ж)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~\b([Кк]раш)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~\b((?:[Пп]о)?[Нн]иж)ѣ\b~u", "$1е", $t);
		$t = preg_replace("~([Кк]оф)ѣ~u", "$1е", $t);
		$t = preg_replace("~([Кк]рестьян)ѣ~u", "$1е", $t);
		$t = preg_replace("~(\wищ)ѣ\b~u", "$1е", $t);
			//$t = preg_replace("~([Сс]т(?:анов|ойб)ищ)ѣ~u", "$1е", $t);
	$t = preg_replace("~и([оею])~u", "і$1", $t);	// іо   - i перед глассной
	$t = preg_replace("/\b(с)ев(ер)?\b/ui", "$1ѣв$2", $t);
	$t = preg_replace("/\b(н)ем(ецк)?\b/ui", "$1ѣм$2", $t);
	$t = preg_replace("/\bи пр\b/u", "ипр", $t);
	$t = preg_replace("/\b(в)иде\b/ui", "видѣ", $t);
	$t = preg_replace("/\b(м)ехъ\b/ui", "мѣхъ", $t);
	$t = preg_replace("/\b(б)олее\b/ui", "$1олѣе", $t);
	$t = preg_replace("/\b(м)енее\b/ui", "$1енѣе", $t);
	$t = preg_replace("/(р)едк/ui", "$1ѣдк", $t);
	$t = preg_replace("/\b(е)[ёе]\b/ui", "$1я", $t);
	$t = preg_replace("/\b([кчт])емъ\b/ui", "$1ѣмъ", $t);
		$t = preg_replace("/\b(г)де\b/ui", "$1дѣ", $t);
	//$t = preg_replace("/\b(в)се\b/ui", "$1сѣ", $t);
	$t = preg_replace("/\b((?:во)?в)сѣ\b/ui", "$1се", $t);
	$t = preg_replace("/(в)се([хм])ъ\b/ui", "$1сѣ$2ъ", $t);
	$t = preg_replace("/(н)иче([мг])/ui", "$1ичѣ$2", $t);
	$t = preg_replace("/\b(д)ве\b/ui", "$1вѣ", $t);
	$t = preg_replace("/\b(д)ейст/ui", "$1ѣйст", $t);
	$t = preg_replace("/(с)ве([тч])/ui", "$1вѣ$2", $t);
	$t = preg_replace("/\bИордан\b/u", "Іордан", $t);
	$t = preg_replace("/\bИоанн\b/u", "Іоанн", $t);
	$t = preg_replace("/(г)ре([хш])/ui", "$1рѣ$2", $t);
	$t = preg_replace("/\b(н)едел\b/ui", "$1едѣл", $t);
	$t = preg_replace("/\b(н)еделе\b/ui", "$1едѣлѣ", $t);
	$t = preg_replace("/\b(х)леб/ui", "$1лѣб", $t);
	$t = preg_replace("/\b(х)лев/ui", "$1лѣв", $t);
	$t = preg_replace("/\b(у)мер[ѣе]т/ui", "$1мерет", $t);
	$t = preg_replace("/\b(р)ек[еѣ]/ui", "$1ѣкѣ", $t);
		$t = preg_replace("/\b([Рр])ек(а|ой|у)/u", "$1ѣк$2", $t);
		$t = preg_replace("/\b([Рр])еч(е?н|к|уш)/u", "$1ѣч$2", $t);
	$t = preg_replace("/ристиан/u", "ристіан", $t);
	$t = preg_replace("/(ч)еловек/ui", "$1еловѣк", $t);
	$t = preg_replace("/(с)осед/ui", "$1осѣд", $t);
	$t = preg_replace("/(т)акжѣ/ui", "$1акже", $t);
	$t = preg_replace("/(з)атем/ui", "$1атѣм", $t);
	$t = preg_replace("/(з)де(сь|ш|в)/ui", "$1дѣ$2", $t);
	$t = preg_replace("/(в)[еѣ]зд[еѣ]/ui", "$1ѣзде", $t);
	$t = preg_replace("/(н)ескольк/ui", "$1ѣскольк", $t);
	$t = preg_replace("/\b(ц)ел/ui", "$1ѣл", $t);
	$t = preg_replace("/(в)ечн/ui", "$1ѣчн", $t);
	$t = preg_replace("/(з)авет/ui", "$1авѣт", $t);
	$t = preg_replace("/(?<!се)(в)ерн/ui", "$1ѣрн", $t);
		$t = preg_replace("/(в)ероят/ui", "$1ѣроят", $t);
	$t = preg_replace("/(в)ет(е?)р/ui", "$1ѣт$2р", $t);
	$t = preg_replace("/(п)овер/ui", "$1овѣр", $t);
	$t = preg_replace("/(к)олен/ui", "$1олѣн", $t);
	$t = preg_replace("/\b(п)е(ш[".$g."]|хот)/ui", "$1ѣ$2", $t);
	$t = preg_replace("/(в)оѣн/ui", "$1оен", $t);
	$t = preg_replace("/\b(м)есто\b/ui", "$1ѣсто", $t);
		$t = preg_replace("/(".$pr."м)е(ст|щ)/ui", "$1ѣ$2", $t);
		$t = preg_replace("/\b(м)е(шо?к)/ui", "$1ѣ$2", $t);
	$t = preg_replace("/\b(д)оме\b/ui", "$1омѣ", $t);
	$t = preg_replace("/(ц)ве([тлс])/ui", "$1вѣ$2", $t);
	$t = preg_replace("/(с)емен/ui", "$1ѣмен", $t);
		$t = preg_replace("/\b(с)емя/ui", "$1ѣмя", $t);
		$t = preg_replace("/([Сс])е([яю])/u", "$1ѣ$2", $t);
	$t = preg_replace("/\b(с)ен([аое])/ui", "$1ѣн$2", $t);
	$t = preg_replace("/\b(с)ет([ьчкие])/ui", "$1ѣт$2", $t);
	$t = preg_replace("/(ж)елез/ui", "$1елѣз", $t);
	$t = preg_replace("/(р)ешет/ui", "$1ѣшет", $t);
	$t = preg_replace("/(д)ел/ui", "$1ѣл", $t);
	$t = preg_replace("/(д)[еѣ]ле/ui", "$1ѣлѣ", $t);
	$t = preg_replace("/(с)евер/ui", "$1ѣвер", $t);
	$t = preg_replace("/(п)римет/ui", "$1римѣт", $t);
	$t = preg_replace("/(?<![Кк]о|х)([Лл])ес/u", "$1ѣс", $t);
	$t = preg_replace("/(м)едвед/ui", "$1едвѣд", $t);
	$t = preg_replace("/\b(з)вѣр/ui", "$1вѣр", $t);
	$t = preg_replace("/(н)асеком/ui", "$1асѣком", $t);
	$t = preg_replace("/(?<!че|бе)(р)ез/ui", "$1ѣз", $t);
	$t = preg_replace("/(д)ет(с?к|е)/ui", "$1ѣт$2", $t);
	$t = preg_replace("/(д)ев(к|уш)/ui", "$1ѣв$2", $t);
	$t = preg_replace("/Спасе/u", "Спасѣ", $t);
	$t = preg_replace("/\b(?<!кп)(л)ет/ui", "$1ѣт", $t);
	$t = preg_replace("/(".$pr."с)тен/ui", "$1тѣн", $t);
	$t = preg_replace("/(с)леп/ui", "$1лѣп", $t);
	$t = preg_replace("/(с)ле([дж])/ui", "$1лѣ$2", $t);
	$t = preg_replace("/(с)пел/ui", "$1пѣл", $t);
	$t = preg_replace("/(б)есед/ui", "$1есѣд", $t);
	$t = preg_replace("/(о)днихъ/ui", "$1днѣхъ", $t);
	$t = preg_replace("/\b([Нн])[еѣ]тъ?\b/u", "$1ѣтъ", $t);
	$t = preg_replace("/\b(в)ек/ui", "$1ѣк", $t);
	$t = preg_replace("/\b(?<!у)(".$pr."м)ер([аыуе]\b|[ио])/ui", "$1ѣр$2", $t);
		$t = preg_replace("/(ч)р[еѣ]зм[еѣ]р/ui", "$1резмѣр", $t);
	$t = preg_replace("/(у)бедит/ui", "$1бѣдит", $t);
	$t = preg_replace("/(?<!по)(л)ев(о|ш|ы)/ui", "$1ѣв$2", $t);
	$t = preg_replace("/(с)пев/ui", "$1пѣв", $t);
	$t = preg_replace("/(с)иден/ui", "$1идѣн", $t);
	$t = preg_replace("/\b(".$pr."в)ес([ъаыу]|ит[ьъ])\b/ui", "$1ѣс$2", $t);
	$t = preg_replace("/\b(р)ек([аиеѣу])/ui", "$1ѣк$2", $t);
		$t = preg_replace("/(?<!г|огу)(р)ечн/ui", "$1ѣчн", $t);
	$t = preg_replace("/(с)ъед/ui", "$1ъѣд", $t);
	//$t = preg_replace("/\bест([ъь])/u", "ѣст$1", $t);	$t = preg_replace("/\bЕст([ъь])/u", "Ѣст$1", $t);
	$t = preg_replace("/\bестъ\b/u", "ѣстъ", $t);	$t = preg_replace("/\bЕстъ\b/u", "Ѣстъ", $t);
	$t = preg_replace("/\bемъ\b/u", "ѣмъ", $t);	$t = preg_replace("/\bЕмъ\b/u", "Ѣмъ", $t);
	$t = preg_replace("/\bед([уеаояиюъ])/u", "ѣд$1", $t);	$t = preg_replace("/\bЕд([уеаояиюъ])/u", "Ѣд$1", $t);
	$t = preg_replace("/\bешь/u", "ѣшь", $t);	$t = preg_replace("/\bЕшь/u", "Ѣшь", $t);
		$t = preg_replace("/(м)ироед/ui", "$1іроѣд", $t);
		$t = preg_replace("/(д)армоед/ui", "$1армоѣд", $t);
	$t = preg_replace("/\b(с)нед/u", "$1нѣд", $t);
	$t = preg_replace("/(о)бед/ui", "$1бѣд", $t);
	$t = preg_replace("/(?<!вб)езд/u", "ѣзд", $t);	$t = preg_replace("/Езд/u", "Ѣзд", $t);
		$t = preg_replace("/\b(".$pr.")е(ха[лт])/u", "$1ѣ$2", $t);   $t = preg_replace("/\bЕ(ха[лт])/u", "Ѣзд", $t);
	$t = preg_replace("/(м)ена/ui", "$1ѣна", $t);
	$t = preg_replace("/(с)ме([хшя])/ui", "$1мѣ$2", $t);
	$t = preg_replace("/(с)не([жг])/ui", "$1нѣ$2", $t);
	$t = preg_replace("/(с)веж/ui", "$1вѣж", $t);
	$t = preg_replace("/(б)лед/ui", "$1лѣд", $t);
	$t = preg_replace("/(?<!колы)(б)ел/ui", "$1ѣл", $t);
	$t = preg_replace("/(г)нев/ui", "$1нѣв", $t);
	$t = preg_replace("/(з)вер/ui", "$1вѣр", $t);
	$t = preg_replace("/(к)реп/ui", "$1рѣп", $t);
	$t = preg_replace("/(с)есть/ui", "$1ѣсть", $t);
	$t = preg_replace("/(?<!ч)(р)е([зж])/ui", "$1ѣ$2", $t);
	$t = preg_replace("/(т)ѣл([оаеу])/ui", "$1ѣл$2", $t);
	$t = preg_replace("/(б)ед([ноаеѣу])/ui", "$1ѣд$2", $t);
	$t = preg_replace("/(с)трел/ui", "$1трѣл", $t);
	$t = preg_replace("/(с)леп/ui", "$1лѣп", $t);
	$t = preg_replace("/(в)стреч/ui", "$1стрѣч", $t);
	//$t = preg_replace("/(".$pr."в)ест/ui", "$1ѣст", $t); путается с омонимом вести'
		$t = preg_replace("/(п)ривет/ui", "$1ривѣт", $t);
		$t = preg_replace("/(о)твет/ui", "$1твѣт", $t);
	$t = preg_replace("/\b(т)ест/ui", "$1ѣст", $t);
	$t = preg_replace("/(к)опейк/ui", "$1опѣйк", $t);
	$t = preg_replace("/(б)олез/ui", "$1олѣз", $t);
	$t = preg_replace("/\b(".$pr."ц)ѣн/ui", "$1ѣн", $t);
	$t = preg_replace("/\b(л)ен(ь|и|тя)/ui", "$1ѣн$2", $t);
	$t = preg_replace("/(п)ету(х|ш)/ui", "$1ѣту$2", $t);
	// ять → е
	$t = preg_replace("/(в)ѣ(р[хш])/ui", "$1е$2", $t);
	$t = preg_replace("~([Пп]ол)ѣ\b~u", "$1е", $t);
	//$t = str_replace("ѣнн", "енн", $t);
	// 	і
	$t = preg_replace("/(м)ирск/ui", "$1ірск", $t);
	$t = preg_replace("/(д)иавол/ui", "$1іавол", $t);
	// ѳ
	$t = preg_replace("/(р)ифм/ui", "$1иѳм", $t);
	$t = str_replace("на ть и на ся", "на ''ть'' и на ''ся''", $t);
	$t = str_replace("действ.", "дѣйст.", $t);
	$t = str_replace("по глаг.", "по гл.", $t);
	$t = str_replace('́','{{акут}}', $t);	$t = str_replace('ˊ','{{акут3}}', $t); // замена ударений на {{акут}}
	return $t;
} */



function convert($t) {
	$t = str_ireplace('{{акут}}','́', $t);	$t = str_ireplace('{{акут3}}','ˊ', $t); // замена {{акут}} на символ ударений, чтобы регуляркам не мешали '{' и много символов.
	global $replaces, $replaces_er_postfix;

	foreach ($replaces as $substr => $r)
		$t = preg_replace('~'.$substr.'~u', $r, $t);

	foreach ($replaces_er_postfix as $substr => $r)
		$t = preg_replace('~'.$substr.'~u', $r, $t);

	return $t;

	// ъ в конце слов после согласных
	//$t = preg_replace("~([цкнгшщзхфвпрлджчсмтб])([][\s.,?!:;'\"() *<]+|-то)(?! */>)~u", "$1ъ$2", $t);
		//$t = preg_replace("~([".$s."])(\.\s*)(?!['\s]*</small|['{(]*[".$a."])~u", "$1ъ$2", $t); // перед точкой в конце текста
		////$t = preg_replace("~([".$s."])(\.) *$~ui", "$1ъ$2", $t); // перед точкой в конце текста
	//$t = preg_replace("~([цкнгшщзхфвпрлджчсмтб])ъ([\s']*\.[\s']*)(</small|[{(]*(?:[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ-]|tsdl|[Вв]ики))~u", "$1$2$3", $t); // исключения ъ и перед точками (в конце предложений), за исключением что это сокращение. Сокращение определяется: если за словом идёт слово со строчной буквы (т.е. это не конец предложения), или слово заключено в тэг </small>.
	//$t = preg_replace("~([".$s."])(\.)( *\{\{tsdbr)~u", "$1ъ$2$3", $t); // в конце сикций

};

