<?php
/**
 * author: User:Vladis13, 2015 — ...
 */

// Константы не работают на сервере tools.wmflabs.org - вызывают "400 - Bad request ". На localhost всё ok.
// Заменяли функции в массивах $regexp и $replaces
const ABIG = 'ЁЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮѢѴІѲ';    // весь алфавит прописными
//const AKUT = "\{\{[Аа]кут\d?\}\}|[́ˊ]"; // ударения
//const AKUT = "́ˊ"; // ударения
//const WORD = "\b(?:[-\w]|".AKUT.")+\b"; // слово
const WORD = "\b(?:[-\ẃˊ]+)\b"; // слово
const S = 'цкнгшщзхфвпрлджчсмтб';                    // согласные буквы, кроме 'ьъ'
const G = 'ёЁеуыаоэяиюѣѢѵѴіІ';                        // гласные
const A = 'ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ';    // весь алфавит
const PR = '(?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т|[Вв]зо)?'; // приставки
//$excl = "(?<!tsd[ls]\|\b.*?)"; // исключать слова в шаблонах. вставить в начало правило замены

$page2DO = new ToDO;
//$t = $page2DO->convert('kk');
// в дореформенную орфографию
class ToDO
{
	function sectionToDO ($txt) {
		$txt = preg_replace_callback('~(<section begin="([^"]*(?:[a-zA-Zа-яёѣѵіѳА-ЯЁѢѴІѲ-](?: \d)?|[^a-zA-Zа-яёѣѵіѳА-ЯЁѢѴІѲ-]\d))"[ /]+>\s*)(.*?)(\s*(?:\s*\{\{tsdbr.*?\}\}\s*)*\s*<section end="\2"[ /]+>)~us',
				function ($s) {
					$t = $s[3];
					$t = $this->convert($t);
					return $s[1].$t.$s[4];
				},
				$txt);
		return $txt;
	}


	function convert($t)
	{
		//$t = $txt;
		//$t = preg_replace("~(\{\{tsd(?:[ls]|br)((?:[-\w|]|\{\{акут\d?\}\}|[́ˊ])+)\}\}|<[^>]+>)~u", '', $txt); // уборка шаблонов и тэгов

//	preg_match_all("~(?<!tsdl\||</|<|\{\{)\b((?:[-\w]|\{\{[Аа]кут\d?\}\}|[́ˊ])+)\b(?!\.[\s{(']*(?:[ЁЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮѢѴІѲ]|</small|tsdl))~u", $t, $words, PREG_OFFSET_CAPTURE); // сборка всех слов, кроме сокращений - вычисляются по наличию точки в конце и затем заглавной буквы или конца тэга
		//$words = array_unique ($words[1]);
//	foreach($words as $w) $txt = str_replace($w, converter($w), $txt);
		//$t = converter($t);
		//echo $t;

		// замена {{акут}} на символ ударений, чтобы регуляркам не мешали '{' и много символов.
		$t = preg_replace('~\{\{акут\}\}~u',  '́', $t);
		$t = preg_replace('~\{\{акут3\}\}~u',  'ˊ', $t);


		// ъ в конце слов после согласных
		$t = preg_replace_callback("~(?<![[<{|/:])(\b(?:[-\ẃˊ]+)\b)(?!\}|\.[\s,;{()']*(?:[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ]|</small|tsdl|tsdbr))~u",
			function ($word) {
				$w = $word[1];
				if (in_array(mb_strtolower($w), $this->stopwords)) return $w;
				foreach ($this->replaces_er_postfix as $s)
					$w = preg_replace('~'.$s[0].'~u', $s[1], $w);
				return $w;
			},
			$t);

		// другая обработка
		$t = preg_replace_callback("~(?<![[<{|/:])(\b(?:[-\ẃˊ]+)\b)~u",  
			// (?<!\[\[[^]]+|{{[^}]+)(?<![[<{|/:])(\b(?:[-\ẃˊ]+)\b)  // в тестере игнорируем обработку шаблонов, но в скрипте глючит
			function ($word) {
				$w = $word[1];
				if (in_array(mb_strtolower($w), $this->stopwords)) return $w;
				foreach ($this->replaces as $s)
					$w = preg_replace('~'.$s[0].'~u', $s[1], $w);
				return $w;
			},
			$t);

		$t = str_replace('́', '{{акут}}',  $t);	// замена ударений на {{акут}}
		$t = str_replace('ˊ', '{{акут3}}', $t);

		return $t;
	}

	var $stopwords = array(
//		'lang','small','tsdl','tsds','tsdbr','section','begin','end', 'razr','razr2','File',  
		'Файл', 'акут',
		'см',
		'ср','сравн',
		'др', 'вм',
		// 'с',
		'стр', 'ч', 'т', 'ст', 'сл',
		'г', 'гг',
		'глаг',
		'гл',
		'Шейн',
		'ипр', 'пр',
		'напр', 'нпр', 'наприм',
		'ж','м','ср','мн',
		'относящ', 'относщс',
		'проч',
	);


	var $replaces_er_postfix = array (
		// ъ в конце слов после согласных
			["([цкнгшщзхфвпрлджчсмтб])\b(?!\.)", "$1ъ"],
			//"([цкнгшщзхфвпрлджчсмтб])([][\s.,?!:;'\"() *<]+|-то)(?! */>)" => "$1ъ$2",
		//"([цкнгшщзхфвпрлджчсмтб])(\.\s*)(?!['\s]*</small|['{(]*[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ])" => "$1ъ$2",  // перед точкой в конце текста
		////"([цкнгшщзхфвпрлджчсмтб])(\.) *$~ui" => "$1ъ$2", // перед точкой в конце текста
		//	"([цкнгшщзхфвпрлджчсмтб])ъ([\s']*\.[\s']*)(</small|[{(']*(?:[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ-]|tsdl|[Вв]ики))" => "$1$2$3", // исключения ъ и перед точками (в конце предложений), за исключением что это сокращение. Сокращение определяется: если за словом идёт слово со строчной буквы (т.е. это не конец предложения), или слово заключено в тэг </small>.
		//	"([цкнгшщзхфвпрлджчсмтб])(\.)( *\{\{tsdbr)", "$1ъ$2$3", // в конце сикций
		["\b([Сс])([мвр])ъ\.", "$1$2."], // иногда проскакивающие сокращения
		["астенъ\.", "астен."],
		["(глаг)ъ\.", "$1."],
		["(гл)ъ\.", "$1."],
		["([Гг]реч)ъ\.", "$1."],
		["([Аа]кут)ъ", "$1"],
		["([Рр]аст(?:ен)?)ъ", "$1"],
		["(упо?трб?л?)ъ\.", "$1."],
		["\b([Пп]ад)ъ\.", "$1."],
		["\b([Рр]ед)ъ\.", "$1."],
		["\b([Оо]тносящ)ъ\.", "$1."],
		["\b([Юю]ж)н?ъ\.", "$1."],
		["\b(ж|м|ср|мн)ъ\.", "$1."],
		["\b([Сс]|[Сс]равн|[Тт])ъ\.", "$1."],
		["\((\w?\w?[цкнгшщзхфвпрлджчсмтб])ъ\)(\w)", "($1)$2"],// убирание ъ внутри закрывающей скобки
		["ъ(\(|\)\w)", "$1"],// исключение: перед или в скобках посреди слов ъ не ставить
		["([Ии])з-за", "$1зъ-за"],// исключение: перед или в скобках посреди слов ъ не ставить


	);

	var $replaces = array(
		// окончания
		// і славянская		
			["(\w)ь([яе])\b", "$1і$2"],  // ье → іе
			["(\w)ь([и])\b", "$1і$2"],  // ьи → іи
				["\b([Чч])[іь]и\b", "$1ьи"],			
			["(\w)ий(ся)?\b", "$1ій$2"],
			["(\w)ийск(\w)", "$1ійск$2"],
			["(\w)кие\b", "$1кіе"],
			["(\w)ни([яю])\b", "$1ні$2"],
			["(\w)и([ияе])\b", "$1і$2"],
		// ѣ
			["(\w)еть(ся)?\b", "$1ѣть$2"],
			["\b([Пп])лѣть\b", "$1леть"],
			["(\w)евать\b", "$1ѣвать"],
			// ["(\w)[еѣ]нн(ый|ая|ое|ые)\b", "$1ѣнн$2"],
			// ["(\w)ѣнн(\w)", "$1енн$2"],
			// ["стве", "ствѣ"],
				// ["([Сс])уществ[еѣ]н", "$1уществен"], естественно
				// ["ствѣн", "ствен"],
			["ели([аи])\b", "ѣли$1"],
			["евать\b", "ѣвать"],
			["\b([Тт])ебе\b", "$1ебѣ"],

		// ые → ыя. отключено: должно применяться при сущ. в женском роде, но не в мужском. без словаря определить род невозможно.
		//"(\w)ые\b" => "$1ыя",

		// ого → аго
			["(\w)ого(?!\{)\b", "$1аго"],
		// исключения
			["\b([Вв])сякаго\b", "$1сякого"],
			["\b([Ээ])таго\b", "$1того"],
			["\b(?<![Вв]ся)([Кк])аго\b", "$1ого"],
			["\b([Мм])наго\b", "$1ного"],
			["\b((?:[Оо]т)?[Тт])аго\b", "$1ого"],

		//приставки
			["\b([Ии])сс", "$1зс"],
			["\b([Рр])асс", "$1азс"],
			["\b([Бб])есс", "$1езс"],


		// ѣ
		// ѣе - ѣ перед е
			["(\w)е(е)\b", "$1ѣ$2"],
			["дущѣе", "дущее"],// иключения
			["([Дд]омашн)ѣе", "$1ее"],
			///"(служащ)ѣе" => "$1ее",
			["(щ)ѣе", "$1ее"],
			["(ыросш)ѣе", "$1ее"],
			["([Пп]о|[Сс])хожѣе", "$1хожее"],
		// ѣ в конце слов после согласных, у, ь
			["([цкнгшщзхфвпрлджчсмтбуь])е(?![-{{́ˊ])\b", "$1ѣ"],// ѣ в конце слов
		// исключения
			["\b([НнЖжСс])ѣ\b", "$1е"],
			["\b([Чч]етыр)ѣ\b", "$1е"],
			["\b([Ии]нач)ѣ\b", "$1е"],
			["\b([Вв]ообщ)ѣ\b", "$1е"],
			["\b([Пп]режд)ѣ\b", "$1е"],
			["\b([Бб]ож)ѣ", "$1е"],
			["([Бб]ольш)ѣ", "$1е"],
			["([Мм]еньш)ѣ", "$1е"],
			["\b([Вв]ыс?ш)ѣ", "$1е"],
			["\b([Нн]и(?:ж|зш))ѣ", "$1е"],
			["([Лл]учш)ѣ", "$1е"],
			["([Хх]уж)ѣ\b", "$1е"],
			["([Тт][оу]ж)ѣ\b", "$1е"],
			["([Лл]ишн)ѣ", "$1е"],
			["([Кк]райн)ѣ", "$1е"],
			["([Рр]анн)ѣ", "$1е"],
			["([Пп])р[еѣ]жд[еѣ]", "$1режде"],
			["([Зз]адн)ѣ", "$1е"],
			["(шевл)ѣ", "$1е"],
			["([Оо]бщ)ѣе", "$1ее"],
			["([с][лр][еѣ]дн)ѣ", "$1е"],
			["\b([Ее]щ)ѣ\b", "$1е"],
			["\b([Уу]ж)ѣ\b", "$1е"],
			["\b([Кк]раш)ѣ\b", "$1е"],
			["\b((?:[Пп]о)?[Нн]иж)ѣ\b", "$1е"],
			["([Кк]оф)ѣ", "$1е"],
			["([Кк]рестьян)ѣ", "$1е"],
			["([Мм]ор)ѣ", "$1е"],
			["(\wищ)ѣ\b", "$1е"],
			//"([Сс]т(?:анов|ойб)ищ)ѣ" => "$1е",
			["опред[еѣ]л[еѣ]н", "опредѣлен"],
			["([Сс])лушайт[еѣ]", "$1лушайте"],
			["(Эпимет|Промет)ѣе", "$1еѣ"],
			
		// + ѣ
			["\b([Сс])ев(ер)?\b", "$1ѣв$2"],
			["\b([Нн])ем(ецк)?\b", "$1ѣм$2"],
			["\bи пр\b", "ипр"],
			["\b([Вв])иде\b", "видѣ"],
			["\b([Мм])ехъ\b", "мѣхъ"],
			["\b([Бб])олее\b", "$1олѣе"],
			["\b([Мм])енее\b", "$1енѣе"],
			["([Рр])едк", "$1ѣдк"],
			["\b([Ее])[ёе]\b", "$1я"],
			["\b([Нн])[еѣ][ёе]\b", "$1ея"],
			["\b([КкЧчТт])емъ\b", "$1ѣмъ"],
			["\b([Гг])де\b", "$1дѣ"],
			//"\b(в)се\b/ui" => "$1сѣ",
			["\b((?:[Вв]о)?[Вв])сѣ\b", "$1се"],
			["([Вв])се([хм])ъ\b", "$1сѣ$2ъ"],
			["([Нн])иче([мг])", "$1ичѣ$2"],
			["([Нн])ичѣго", "$1ичего"],
			["\b([Дд])ве\b", "$1вѣ"],
			["\b([Дд])венадц", "$1вѣнадц"],
			["\b([Дд])ейст", "$1ѣйст"],
			["([Сс])ве([тч])", "$1вѣ$2"],
			["([Гг])ре([хш])", "$1рѣ$2"],
			["\b([Нн])едел\b", "$1едѣл"],
			["\b([Нн])еделе\b", "$1едѣлѣ"],
			["\b([Хх])леб", "$1лѣб"],
			["\b([Хх])лев", "$1лѣв"],
			["\b([Уу])мер[ѣе]т", "$1мерет"],
			["\b([Рр])ек[еѣ]", "$1ѣкѣ"],
			["\b([Рр])ек(а|ой|у)", "$1ѣк$2"],
			["\b([Рр])еч(е?н|к|уш)", "$1ѣч$2"],
			["([Чч])еловек", "$1еловѣк"],
			["([Сс])осед", "$1осѣд"],
			["([Тт])акжѣ", "$1акже"],
			["([Зз])атем", "$1атѣм"],
			["([Зз])де(сь|ш|в)", "$1дѣ$2"],
			["([Вв])[еѣ]зд[еѣ]", "$1ѣзде"],
			["([Нн])ескольк", "$1ѣскольк"],
			["([Нн])екотор", "$1ѣкотор"],
				["([Нн])[еѣ]которые", "$1ѣкоторыя"],
			["\b([Цц])ел", "$1ѣл"],
			["([Вв])ечн", "$1ѣчн"],
			["([Зз])авет", "$1авѣт"],
			["(?<![Сс][ѣе])([Вв])ерн", "$1ѣрн"],
				["([Вв])ероят", "$1ѣроят"],
			["([Вв])ет(е?)р", "$1ѣт$2р"],
			["([Пп])овер", "$1овѣр"],
			["([Кк])олен", "$1олѣн"],
			["\b([Пп])е(ш[ёЁеуыаоэяиюѣѢѵѴіІ]|хот)", "$1ѣ$2"],
			["([Вв])оѣн", "$1оен"],
			["\b([Мм])есто\b", "$1ѣсто"],
			["\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Мм])е(ст|щ)", "$1ѣ$2"],
			["\b([Мм])е(шо?к)", "$1ѣ$2"],
			["\b([Зз])амеч", "$1амѣч"],
			["\b([Дд])оме\b", "$1омѣ"],
			["([Цц])ве([тлс])", "$1вѣ$2"],
			["([Сс])емен", "$1ѣмен"],
			["\b([Сс])емя", "$1ѣмя"],
			["([Сс])е([яю])", "$1ѣ$2"],
			["\b([Сс])ен([аое])", "$1ѣн$2"],
			["\b([Сс])ет([ьчкие])", "$1ѣт$2"],
			["([Жж])елез", "$1елѣз"],
			["([Рр])ешет", "$1ѣшет"],
			["([Дд])ел", "$1ѣл"],
			["([Дд])[еѣ]ле(?!н)", "$1ѣлѣ"],
			["([Сс])евер", "$1ѣвер"],
			["([Пп])римет", "$1римѣт"],
			["(?<![Кк]о|[Хх])([Лл])ес", "$1ѣс"],
			["([Мм])едвед", "$1едвѣд"],
			["\b([Зз])вѣр", "$1вѣр"],
			//"([Зз])вер" => "$1вѣр",
			["([Нн])асеком", "$1асѣком"],
			["([Дд])ет(с?к|е|и\b)", "$1ѣт$2"],
			["\b([Дд])ет(о)", "$1ѣт$2"],
			["([Дд])ев(к|уш)", "$1ѣв$2"],
			["Спасе", "Спасѣ"],
			["\b(?<![КкПп])([Лл])ет", "$1ѣт"],
			["\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Сс])тен", "$1тѣн"],
			["([Сс])леп", "$1лѣп"],
			["([Сс])ле([дж])", "$1лѣ$2"],
			["([Сс])пел", "$1пѣл"],
			["([Бб])есед", "$1есѣд"],
			["([Оо])днихъ", "$1днѣхъ"],
			["\b([Нн])[еѣ]тъ?\b", "$1ѣтъ"],
			["\b([Вв])ек", "$1ѣк"],
			["\b(?<![Уу])((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Мм])ер([аыуе]\b|[ио])", "$1ѣр$2"],
			["([Чч])р[еѣ]зм[еѣ]р", "$1резмѣр"],
			["([Чч])[еѣ]р[еѣ]з", "$1ерез"],
			["([Уу])бедит", "$1бѣдит"],
			["(?<![Пп]о)([Лл])ев(о|ш|ы)", "$1ѣв$2"],
			["([Сс])пев", "$1пѣв"],
			["([Сс])иден", "$1идѣн"],
			["\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Вв])ес([ъаыу]|ит[ьъ])\b", "$1ѣс$2"],
			["\b([Рр])ек([аиеѣу])", "$1ѣк$2"],
			["(?<![Гг]|[Оо]гу)([Рр])ечн", "$1ѣчн"],
			["([Сс])ъед", "$1ъѣд"],
			//"\bест([ъь])" => "ѣст$1",	"\bЕст([ъь])" => "Ѣст$1",
			["\bестъ\b", "ѣстъ"],
				["\bЕстъ\b", "Ѣстъ"],
			["\bемъ\b", "ѣмъ"],
				["\bЕмъ\b", "Ѣмъ"],
			["\bед([уеаояиюъ])", "ѣд$1"],
				["\bЕд([уеаояиюъ])", "Ѣд$1"],
			["\bешь", "ѣшь"],
				["\bЕшь", "Ѣшь"],
			["([Мм])ироед", "$1іроѣд"],
				["([Дд])армоед", "$1армоѣд"],
			["\b([Сс])нед", "$1нѣд"],
			["([Оо])бед", "$1бѣд"],
			["(?<![ВвБб])езд", "ѣзд"],
				["Езд", "Ѣзд"],
			["\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?)е(ха[лт])", "$1ѣ$2"],
				["\bЕ(ха[лт])", "Ѣзд"],
			
			["\b([еѣ])дин", "един"],
				["\b([ЕѢ])дин", "Един"],
			["([Мм])ена", "$1ѣна"],
			["([Мм])н[еѣ]н[иьі]е", "$1нѣнье"],
			["([Ии])мѣна", "$1мена"],
			["([Вв])ладенье", "$1ладѣнье"],
			["([Сс])обствѣ", "$1обстве"],			
			["([Сс])ме([хшя])", "$1мѣ$2"],
			["([Сс])не([жг])", "$1нѣ$2"],
			["([Сс])веж", "$1вѣж"],
			["([Бб])лед", "$1лѣд"],
			["(?<![Кк]олы)([Бб])ел", "$1ѣл"],
			["([Гг])нев", "$1нѣв"],
			["([Кк])реп", "$1рѣп"],
			["([Сс])есть", "$1ѣсть"],
			["\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?(?<![Чч]е|[Бб]е)[Рр])е([зж])(?!ул)", "$1ѣ$2"],
			["([Тт])ел([оаеу]\b|есн|одв)", "$1ѣл$2"],
			["([Бб])ед([ноаеѣу])", "$1ѣд$2"],
			["([Сс])трел", "$1трѣл"],
			["([Оо])гнѣ([вн])", "$1гне$2"],
			["([Вв])стреч", "$1стрѣч"],
			//"((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?в)ест/ui" => "$1ѣст",путается с омонимом вести'
				["([Ии])звест", "$1звѣст"],			
			["([Нн])евеж", "$1евѣж"],			
			["([Пп])ривет", "$1ривѣт"],
			["([Оо])твет", "$1твѣт"],
			["\b([Тт])ест", "$1ѣст"],
			["([Кк])опейк", "$1опѣйк"],
			["([Кк])алек", "$1алѣк"],
			["([Бб])олез", "$1олѣз"],
			["\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Цц])ѣн", "$1ѣн"],
			["\b([Лл])ен(ь|и|тя)", "$1ѣн$2"],
			["([Пп])ету(х|ш)", "$1ѣту$2"],
			["\b([ИиУу])ме(ет|ю|нь[еі]|ющ|ть|я)\b", "$1мѣ$2"],
				["\b([Уу])мен[іь]", "$1мѣнь$2"],
			["([Гг])ражданѣ", "$1раждане"],
			["([Мм])н[еѣ]н[иьі]е", "$1нѣнье"],
			["([Ии])мѣна", "$1мена"],
			["([Вв])ладен", "$1ладѣн"],
			["([Сс])обствѣ", "$1обстве"],
			
			// исключения
			["([Гг])ражданѣ", "$1раждане"],
			["([Вв])ожд[еѣ]л[еѣ]н", "$1ожделѣн"],

		// окончание -ел → -ѣл
			["([Хх])отел", "$1отѣл"],

		// ѣ → е
			["([Вв])ѣ(р[хш])", "$1е$2"],
			["\b((?:[Пп]о)?[Гг])ибѣл", "$1ибел"],
			["\b([Гг])орѣ\b", "$1оре"],
			["([Пп]ол)ѣ\b", "$1е"],
			["\b([Пп]р)ѣ(до?к)", "$1е$2"]
			

		// 	і
			// i перед глассной
			["(\w)и([ая])", "$1і$2"],
			["и([оею])", "і$1"],
			["И([оею])", "І$1"],
			
			["\bИордан\b", "Іордан"],
			["\bИоанн\b", "Іоанн"],
			["ристиан", "ристіан"],
			["\b([Мм])ир", "$1ір"],
				["([Мм])ирск", "$1ірск"],
			["([Дд])иавол", "$1іавол"],
			["([Аа])нглий", "$1нглій"],
			["([Пп])риятн", "$1ріятн"],
			["Эриксиа", "Эриксіа"],

		// ѳ
			["([Рр])ифм", "$1иѳм"],
			["([Аа])нафе", "$1наѳе"],
			["Ф(ео?до[ср])", "Ѳ$1"],
			["ф(ео?до[ср])", "ѳ$1"],
			["Ф(екл)", "Ѳ$1"],
			["\bФ(ом)", "Ѳ$1"],
			
			["\b([Пп])ифагор", "$1иѳагор"],
			["\bФеаг", "Ѳеаг"],			
			["Феодор", "Ѳеодор"],
			["Фамус", "Ѳамус"],
			["Фукидид", "Ѳукидид"],
			["\b([Кк])оринф", "$1оринѳ"],
			["\b([Кк])арфаг", "$1арѳаг"],
			["\bИфест", "Иѳест"],
			["\b([Аа])фин", "$1ѳин"],
			["\bФив(ы|а|анск|ск|еец|анц|\b)", "Ѳив$1"],			
				["\bфив(ан|ск)", "ѳив$1"],
			["\bФессал", "Ѳессал"],
			["\b([Пп])ифи(я|й|ю|е)", "$1иѳи$2"],
			["\b([Мм])иф", "$1иѳ"],


		// сокращения
			["на ть и на ся", "на ''ть'' и на ''ся''"],
			["действ\.", "дѣйст."],
			["по глаг\.", "по гл."],
			["\bчъ\.", "ч."],

	);
}


// $y = 'Сравн.';
// $u = $page2DO->convert($y);
// echo $u;