#!/usr/bin/env python3
# coding: utf8
#
# author: https://github.com/vladiscripts
#
import re

# import mwparserfromhell
# import pywikibot
# import vladi_commons


stopwords = [
    # 		'lang','small','tsdl','tsds','tsdbr','section','begin','end', 'razr','razr2','File',
    'Файл', 'акут',
    'см',
    'ср', 'сравн',
    'др', 'вм',
    #  'с',
    'стр', 'ч', 'т', 'ст', 'сл',
    'г', 'гг',
    'глаг',
    'гл',
    'Шейн',
    'ипр', 'пр',
    'напр', 'нпр', 'наприм',
    'ж', 'м', 'ср', 'мн',
    'относящ', 'относщс',
    'проч',
]

replaces_er_postfix = [
    #  ъ в конце слов после согласных
    # исключая слов перед точками. Не поврежд. сокращения (не работает почему-то), но не обр. последние сл. предложений.
    [r"([цкнгшщзхфвпрлджчсмтб])\b(?!\.)", r"\1ъ"],
    # [r"([цкнгшщзхфвпрлджчсмтб])\b", r"\1ъ"],

    # "([цкнгшщзхфвпрлджчсмтб])([][\s.,?!:;'\"() *<]+|-то)(?! */>)" => "\1ъ\2",
    # "([цкнгшщзхфвпрлджчсмтб])(\.\s*)(?!['\s]*</small|['{(]*[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ])" => "\1ъ\2",  // перед точкой в конце текста
    # //"([цкнгшщзхфвпрлджчсмтб])(\.) *$~ui" => "\1ъ\2", // перед точкой в конце текста
    # 	"([цкнгшщзхфвпрлджчсмтб])ъ([\s']*\.[\s']*)(</small|[{(']*(?:[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ-]|tsdl|[Вв]ики))" => "\1\2\3", // исключения ъ и перед точками (в конце предложений), за исключением что это сокращение. Сокращение определяется: если за словом идёт слово со строчной буквы (т.е. это не конец предложения), или слово заключено в тэг </small>.
    # 	"([цкнгшщзхфвпрлджчсмтб])(\.)( *\{\{tsdbr)", r"\1ъ\2\3", // в конце сикций
    [r"\b([Сс])([мвр])ъ\.", r"\1\2."],  # иногда проскакивающие сокращения
    [r"астенъ\.", r"астен."],
    [r"(глаг)ъ\.", r"\1."],
    [r"(гл)ъ\.", r"\1."],
    [r"([Гг]реч)ъ\.", r"\1."],
    [r"([Аа]кут)ъ", r"\1"],
    [r"([Рр]аст(?:ен)?)ъ", r"\1"],
    [r"(упо?трб?л?)ъ\.", r"\1."],
    [r"\b([Пп]ад)ъ\.", r"\1."],
    [r"\b([Рр]ед)ъ\.", r"\1."],
    [r"\b([Оо]тносящ)ъ\.", r"\1."],
    [r"\b([Оо]днокр)ъ\.", r"\1."],
    [r"\b([Юю]ж)н?ъ\.", r"\1."],
    [r"\b(ж|м|ср|мн)ъ\.", r"\1."],
    [r"\b([Сс]|[Сс]равн|[Тт])ъ\.", r"\1."],
    [r"\((\w?\w?[цкнгшщзхфвпрлджчсмтб])ъ\)(\w)", r"(\1)\2"],  # убирание ъ внутри закрывающей скобки
    [r"ъ(\(|\)\w)", r"\1"],  # исключение: перед или в скобках посреди слов ъ не ставить
    [r"([Ии])з-за", r"\1зъ-за"],  # исключение: перед или в скобках посреди слов ъ не ставить

    [r"\bуръ-казч.", "ур-казч."],
    [r"\b([Сс]аж)ъ\.", r"\1."],
]

other_replaces_rules = [
    #  окончания
    #  і славянская
    [r"(\w)ь([яе])\b", r"\1і\2"],  # ье → іе
    [r"(\w)ь([и])\b", r"\1і\2"],  # ьи → іи
    [r"\b([Чч])[іь]и\b", r"\1ьи"],
    [r"(\w)ий(ся)?\b", r"\1ій\2"],
    [r"(\w)ийск(\w)", r"\1ійск\2"],
    [r"(\w)кие\b", r"\1кіе"],
    [r"(\w)ни([яю])\b", r"\1ні\2"],
    [r"(\w)и([ияе])\b", r"\1і\2"],
    #  ѣ
    [r"(\w)еть(ся)?\b", r"\1ѣть\2"],
    [r"\b([Пп])лѣть\b", r"\1леть"],
    [r"(\w)евать\b", r"\1ѣвать"],
    #  [r"(\w)[еѣ]нн(ый|ая|ое|ые)\b", r"\1ѣнн\2"],
    #  [r"(\w)ѣнн(\w)", r"\1енн\2"],
    #  [r"стве", r"ствѣ"],
    #  [r"([Сс])уществ[еѣ]н", r"\1уществен"], естественно
    #  [r"ствѣн", r"ствен"],
    [r"ели([аи])\b", r"ѣли\1"],
    [r"евать\b", r"ѣвать"],
    [r"\b([Тт])ебе\b", r"\1ебѣ"],

    #  ые → ыя. отключено: должно применяться при сущ. в женском роде, но не в мужском. без словаря определить род невозможно.
    # "(\w)ые\b" => "\1ыя",

    #  ого → аго
    [r"(\w)ого(?!\{)\b", r"\1аго"],
    #  исключения
    [r"\b([Вв])сякаго\b", r"\1сякого"],
    [r"\b([Ээ])таго\b", r"\1того"],
    [r"\b(?<![Вв]ся)([Кк])аго\b", r"\1ого"],
    [r"\b([Мм])наго\b", r"\1ного"],
    [r"\b((?:[Оо]т)?[Тт])аго\b", r"\1ого"],

    # приставки
    [r"\b([Ии])сс", r"\1зс"],
    [r"\b([Рр])асс", r"\1азс"],
    [r"\b([Бб])есс", r"\1езс"],

    #  ѣ
    #  ѣе - ѣ перед е
    [r"(\w)е(е)\b", r"\1ѣ\2"],
    [r"дущѣе", r"дущее"],  # иключения
    [r"([Дд]омашн)ѣе", r"\1ее"],
    # /"(служащ)ѣе" => "\1ее",
    [r"(щ)ѣе", r"\1ее"],
    [r"(ыросш)ѣе", r"\1ее"],
    [r"([Пп]о|[Сс])хожѣе", r"\1хожее"],
    #  ѣ в конце слов после согласных, у, ь
    [r"([цкнгшщзхфвпрлджчсмтбуь])е(?![-{{́ˊ])\b", r"\1ѣ"],  # ѣ в конце слов
    #  исключения
    [r"\b([НнЖжСс])ѣ\b", r"\1е"],
    [r"\b([Чч]етыр)ѣ\b", r"\1е"],
    [r"\b([Ии]нач)ѣ\b", r"\1е"],
    [r"\b([Вв]ообщ)ѣ\b", r"\1е"],
    [r"\b([Пп]режд)ѣ\b", r"\1е"],
    [r"\b([Бб]ож)ѣ", r"\1е"],
    [r"([Бб]ольш)ѣ", r"\1е"],
    [r"([Мм]еньш)ѣ", r"\1е"],
    [r"\b([Вв]ыс?ш)ѣ", r"\1е"],
    [r"\b([Нн]и(?:ж|зш))ѣ", r"\1е"],
    [r"([Лл]учш)ѣ", r"\1е"],
    [r"([Хх]уж)ѣ\b", r"\1е"],
    [r"([Тт][оу]ж)ѣ\b", r"\1е"],
    [r"([Лл]ишн)ѣ", r"\1е"],
    [r"([Кк]райн)ѣ", r"\1е"],
    [r"([Рр]анн)ѣ", r"\1е"],
    [r"([Пп])р[еѣ]жд[еѣ]", r"\1режде"],
    [r"([Зз]адн)ѣ", r"\1е"],
    [r"(шевл)ѣ", r"\1е"],
    [r"([Оо]бщ)ѣе", r"\1ее"],
    [r"([с][лр][еѣ]дн)ѣ", r"\1е"],
    [r"\b([Ее]щ)ѣ\b", r"\1е"],
    [r"\b([Уу]ж)ѣ\b", r"\1е"],
    [r"\b([Кк]раш)ѣ\b", r"\1е"],
    [r"\b((?:[Пп]о)?[Нн]иж)ѣ\b", r"\1е"],
    [r"([Кк]оф)ѣ", r"\1е"],
    [r"([Кк]рестьян)ѣ", r"\1е"],
    [r"([Мм]ор)ѣ", r"\1е"],
    [r"(\wищ)ѣ\b", r"\1е"],
    # "([Сс]т(?:анов|ойб)ищ)ѣ" => "\1е",
    [r"опред[еѣ]л[еѣ]н", r"опредѣлен"],
    [r"([Сс])лушайт[еѣ]", r"\1лушайте"],
    [r"(Эпимет|Промет)ѣе", r"\1еѣ"],

    #  + ѣ
    [r"\b([Сс])ев(ер)?\b", r"\1ѣв\2"],
    [r"\b([Нн])ем(ецк)?\b", r"\1ѣм\2"],
    [r"\bи пр\b", r"ипр"],
    [r"\b([Вв])иде\b", r"видѣ"],
    [r"\b([Мм])ехъ\b", r"мѣхъ"],
    [r"\b([Бб])олее\b", r"\1олѣе"],
    [r"\b([Мм])енее\b", r"\1енѣе"],
    [r"([Рр])едк", r"\1ѣдк"],
    [r"\b([Ее])[ёе]\b", r"\1я"],
    [r"\b([Нн])[еѣ][ёе]\b", r"\1ея"],
    [r"\b([КкЧчТт])емъ\b", r"\1ѣмъ"],
    [r"\b([Гг])де\b", r"\1дѣ"],
    # "\b(в)се\b/ui" => "\1сѣ",
    [r"\b((?:[Вв]о)?[Вв])сѣ\b", r"\1се"],
    [r"([Вв])се([хм])ъ\b", r"\1сѣ\2ъ"],
    [r"([Нн])иче([мг])", r"\1ичѣ\2"],
    [r"([Нн])ичѣго", r"\1ичего"],
    [r"\b([Дд])ве\b", r"\1вѣ"],
    [r"\b([Дд])венадц", r"\1вѣнадц"],
    [r"\b([Дд])ейст", r"\1ѣйст"],
    [r"([Сс])ве([тч])", r"\1вѣ\2"],
    [r"([Гг])ре([хш])", r"\1рѣ\2"],
    [r"\b([Нн])едел\b", r"\1едѣл"],
    [r"\b([Нн])еделе\b", r"\1едѣлѣ"],
    [r"\b([Хх])леб", r"\1лѣб"],
    [r"\b([Хх])лев", r"\1лѣв"],
    [r"\b([Уу])мер[ѣе]т", r"\1мерет"],
    [r"\b([Рр])ек[еѣ]", r"\1ѣкѣ"],
    [r"\b([Рр])ек(а|ой|у)", r"\1ѣк\2"],
    [r"\b([Рр])еч(е?н|к|уш)", r"\1ѣч\2"],
    [r"([Чч])еловек", r"\1еловѣк"],
    [r"([Сс])осед", r"\1осѣд"],
    [r"([Тт])акжѣ", r"\1акже"],
    [r"([Зз])атем", r"\1атѣм"],
    [r"([Зз])де(сь|ш|в)", r"\1дѣ\2"],
    [r"([Вв])[еѣ]зд[еѣ]", r"\1ѣзде"],
    [r"([Нн])ескольк", r"\1ѣскольк"],
    [r"([Нн])екотор", r"\1ѣкотор"],
    [r"([Нн])[еѣ]которые", r"\1ѣкоторыя"],
    [r"\b([Цц])ел", r"\1ѣл"],
    [r"([Вв])ечн", r"\1ѣчн"],
    [r"([Зз])авет", r"\1авѣт"],
    [r"(?<![Сс][ѣе])([Вв])ерн", r"\1ѣрн"],
    [r"([Вв])ероят", r"\1ѣроят"],
    [r"([Вв])ет(е?)р", r"\1ѣт\2р"],
    [r"([Пп])овер", r"\1овѣр"],
    [r"([Кк])олен", r"\1олѣн"],
    [r"\b([Пп])е(ш[ёЁеуыаоэяиюѣѢѵѴіІ]|хот)", r"\1ѣ\2"],
    [r"([Вв])оѣн", r"\1оен"],
    [r"\b([Мм])есто\b", r"\1ѣсто"],
    [r"\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Мм])е(ст|щ)", r"\1ѣ\2"],
    [r"\b([Мм])е(шо?к)", r"\1ѣ\2"],
    [r"\b([Зз])амеч", r"\1амѣч"],
    [r"\b([Дд])оме\b", r"\1омѣ"],
    [r"([Цц])ве([тлс])", r"\1вѣ\2"],
    [r"([Сс])емен", r"\1ѣмен"],
    [r"\b([Сс])емя", r"\1ѣмя"],
    [r"([Сс])е([яю])", r"\1ѣ\2"],
    [r"\b([Сс])ен([аое])", r"\1ѣн\2"],
    [r"\b([Сс])ет([ьчкие])", r"\1ѣт\2"],
    [r"([Жж])елез", r"\1елѣз"],
    [r"([Рр])ешет", r"\1ѣшет"],
    [r"([Дд])ел", r"\1ѣл"],
    [r"([Дд])[еѣ]ле(?!н)", r"\1ѣлѣ"],
    [r"([Сс])евер", r"\1ѣвер"],
    [r"([Пп])римет", r"\1римѣт"],
    [r"(?<![Кк]о)(?<![Хх])([Лл])ес", r"\1ѣс"],
    [r"([Мм])едвед", r"\1едвѣд"],
    [r"\b([Зз])вѣр", r"\1вѣр"],
    # "([Зз])вер" => "\1вѣр",
    [r"([Нн])асеком", r"\1асѣком"],
    [r"([Дд])ет(с?к|е|и\b)", r"\1ѣт\2"],
    [r"\b([Дд])ет(о)", r"\1ѣт\2"],
    [r"([Дд])ев(к|уш)", r"\1ѣв\2"],
    [r"Спасе", r"Спасѣ"],
    [r"\b(?<![КкПп])([Лл])ет", r"\1ѣт"],
    [r"\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Сс])тен", r"\1тѣн"],
    [r"([Сс])леп", r"\1лѣп"],
    [r"([Сс])ле([дж])", r"\1лѣ\2"],
    [r"([Сс])пел", r"\1пѣл"],
    [r"([Бб])есед", r"\1есѣд"],
    [r"([Оо])днихъ", r"\1днѣхъ"],
    [r"\b([Нн])[еѣ]тъ?\b", r"\1ѣтъ"],
    [r"\b([Вв])ек", r"\1ѣк"],
    [r"\b(?<![Уу])((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Мм])ер([аыуе]\b|[ио])",
     r"\1ѣр\2"],
    [r"([Чч])р[еѣ]зм[еѣ]р", r"\1резмѣр"],
    [r"([Чч])[еѣ]р[еѣ]з", r"\1ерез"],
    [r"([Уу])бедит", r"\1бѣдит"],
    [r"(?<![Пп]о)([Лл])ев(о|ш|ы)", r"\1ѣв\2"],
    [r"([Сс])пев", r"\1пѣв"],
    [r"([Сс])иден", r"\1идѣн"],
    [r"\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Вв])ес([ъаыу]|ит[ьъ])\b", r"\1ѣс\2"],
    [r"\b([Рр])ек([аиеѣу])", r"\1ѣк\2"],
    [r"(?<![Гг])(?<![Оо]гу)([Рр])ечн", r"\1ѣчн"],
    [r"([Сс])ъед", r"\1ъѣд"],
    # "\bест([ъь])" => "ѣст\1",	"\bЕст([ъь])" => "Ѣст\1",
    [r"\bестъ\b", r"ѣстъ"],
    [r"\bЕстъ\b", r"Ѣстъ"],
    [r"\bемъ\b", r"ѣмъ"],
    [r"\bЕмъ\b", r"Ѣмъ"],
    [r"\bед([уеаояиюъ])", r"ѣд\1"],
    [r"\bЕд([уеаояиюъ])", r"Ѣд\1"],
    [r"\bешь", r"ѣшь"],
    [r"\bЕшь", r"Ѣшь"],
    [r"([Мм])ироед", r"\1іроѣд"],
    [r"([Дд])армоед", r"\1армоѣд"],
    [r"\b([Сс])нед", r"\1нѣд"],
    [r"([Оо])бед", r"\1бѣд"],
    [r"(?<![ВвБб])езд", r"ѣзд"],
    [r"Езд", r"Ѣзд"],
    [r"\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?)е(ха[лт])", r"\1ѣ\2"],
    [r"\bЕ(ха[лт])", r"Ѣзд"],

    [r"\b([еѣ])дин", r"един"],
    [r"\b([ЕѢ])дин", r"Един"],
    [r"([Мм])ена", r"\1ѣна"],
    [r"([Мм])н[еѣ]н[иьі]е", r"\1нѣнье"],
    [r"([Ии])мѣна", r"\1мена"],
    [r"([Вв])ладенье", r"\1ладѣнье"],
    [r"([Сс])обствѣ", r"\1обстве"],
    [r"([Сс])ме([хшя])", r"\1мѣ\2"],
    [r"([Сс])не([жг])", r"\1нѣ\2"],
    [r"([Сс])веж", r"\1вѣж"],
    [r"([Бб])лед", r"\1лѣд"],
    [r"(?<![Кк]олы)([Бб])ел", r"\1ѣл"],
    [r"([Гг])нев", r"\1нѣв"],
    [r"([Кк])реп", r"\1рѣп"],
    [r"([Сс])есть", r"\1ѣсть"],
    [r"\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?(?<![Чч]е)(?<![Бб]е)[Рр])е([зж])(?!ул)",
     r"\1ѣ\2"],
    [r"([Тт])ел([оаеу]\b|есн|одв)", r"\1ѣл\2"],
    [r"([Бб])ед([ноаеѣу])", r"\1ѣд\2"],
    [r"([Сс])трел", r"\1трѣл"],
    [r"([Оо])гнѣ([вн])", r"\1гне\2"],
    [r"([Вв])стреч", r"\1стрѣч"],
    # "((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?в)ест/ui" => "\1ѣст",путается с омонимом вести'
    [r"([Ии])звест", r"\1звѣст"],
    [r"([Нн])евеж", r"\1евѣж"],
    [r"([Пп])ривет", r"\1ривѣт"],
    [r"([Оо])твет", r"\1твѣт"],
    [r"\b([Тт])ест", r"\1ѣст"],
    [r"([Кк])опейк", r"\1опѣйк"],
    [r"([Кк])алек", r"\1алѣк"],
    [r"([Бб])олез", r"\1олѣз"],
    [r"\b((?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т)?[Цц])ѣн", r"\1ѣн"],
    [r"\b([Лл])ен(ь|и|тя)", r"\1ѣн\2"],
    [r"([Пп])ету(х|ш)", r"\1ѣту\2"],
    [r"\b([ИиУу])ме(ет|ю|нь[еі]|ющ|ть|я)\b", r"\1мѣ\2"],
    [r"\b([Уу])мен[іь]", r"\1мѣнь"],
    [r"([Гг])ражданѣ", r"\1раждане"],
    [r"([Мм])н[еѣ]н[иьі]е", r"\1нѣнье"],
    [r"([Ии])мѣна", r"\1мена"],
    [r"([Вв])ладен", r"\1ладѣн"],
    [r"([Сс])обствѣ", r"\1обстве"],

    #  исключения
    [r"([Гг])ражданѣ", r"\1раждане"],
    [r"([Вв])ожд[еѣ]л[еѣ]н", r"\1ожделѣн"],

    #  окончание -ел → -ѣл
    [r"([Хх])отел", r"\1отѣл"],

    #  ѣ → е
    [r"([Вв])ѣ(р[хш])", r"\1е\2"],
    [r"\b((?:[Пп]о)?[Гг])ибѣл", r"\1ибел"],
    [r"\b([Гг])орѣ\b", r"\1оре"],
    [r"([Пп]ол)ѣ\b", r"\1е"],
    [r"\b([Пп]р)ѣ(до?к)", r"\1е\2"],

    #  	і
    #  i перед глассной
    [r"(\w)и([ая])", r"\1і\2"],
    [r"и([оею])", r"і\1"],
    [r"И([оею])", r"І\1"],

    [r"\bИордан\b", r"Іордан"],
    [r"\bИоанн\b", r"Іоанн"],
    [r"ристиан", r"ристіан"],
    [r"\b([Мм])ир", r"\1ір"],
    [r"([Мм])ирск", r"\1ірск"],
    [r"([Дд])иавол", r"\1іавол"],
    [r"([Аа])нглий", r"\1нглій"],
    [r"([Пп])риятн", r"\1ріятн"],
    [r"Эриксиа", r"Эриксіа"],

    #  ѳ
    [r"([Рр])ифм", r"\1иѳм"],
    [r"([Аа])нафе", r"\1наѳе"],
    [r"Ф(ео?до[ср])", r"Ѳ\1"],
    [r"ф(ео?до[ср])", r"ѳ\1"],
    [r"Ф(екл)", r"Ѳ\1"],
    [r"\bФ(ом)", r"Ѳ\1"],

    [r"\b([Пп])ифагор", r"\1иѳагор"],
    [r"\bФеаг", r"Ѳеаг"],
    [r"Феодор", r"Ѳеодор"],
    [r"Фамус", r"Ѳамус"],
    [r"Фукидид", r"Ѳукидид"],
    [r"\b([Кк])оринф", r"\1оринѳ"],
    [r"\b([Кк])арфаг", r"\1арѳаг"],
    [r"\bИфест", r"Иѳест"],
    [r"\b([Аа])фин", r"\1ѳин"],
    [r"\bФив(ы|а|анск|ск|еец|анц|\b)", r"Ѳив\1"],
    [r"\bфив(ан|ск)", r"ѳив\1"],
    [r"\bФессал", r"Ѳессал"],
    [r"\b([Пп])ифи(я|й|ю|е)", r"\1иѳи\2"],
    [r"\b([Мм])иф", r"\1иѳ"],

    #  сокращения
    [r"на ть и на ся", r"на ''ть'' и на ''ся''"],
    [r"действ\.", r"дѣйст."],
    [r"по глаг\.", r"по гл."],
    [r"\bчъ\.", r"ч."],

]


# t = $page2DO->convert('kk');
#  в дореформенную орфографию
class ToDO:
    # for PHP, для Python не проверено: Константы не работают на сервере tools.wmflabs.org - вызывают "400 - Bad request ". На localhost всё ok.
    # Заменяли функции в массивах $regexp и $replaces
    ABIG = 'ЁЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮѢѴІѲ'  # весь алфавит прописными
    # const AKUT = "\{\{[Аа]кут\d?\}\}|[́ˊ]"; // ударения
    # const AKUT = "́ˊ"; // ударения
    # const WORD = "\b(?:[-\w]|".AKUT.")+\b"; // слово
    WORD = "\b(?:[-\ẃˊ]+)\b"  # слово
    S = 'цкнгшщзхфвпрлджчсмтб'  # согласные буквы, кроме 'ьъ'
    G = 'ёЁеуыаоэяиюѣѢѵѴіІ'  # гласные
    A = 'ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ'  # весь алфавит
    PR = '(?:[Пп]ри|[Нн]а|[Пп]ере|[Пп]о|[Пп]од|[Зз]а|[Сс]о?|[Ии]з|[Вв]|[Оо]т|[Вв]зо)?'  # приставки
    # excl = "(?<!tsd[ls]\|\b.*?)"; // исключать слова в шаблонах. вставить в начало правило замены

    # section_re = re.compile(r'(<section begin="([^"]*(?:[a-zA-Zа-яёѣѵіѳА-ЯЁѢѴІѲ-](?: \d)?|[^a-zA-Zа-яёѣѵіѳА-ЯЁѢѴІѲ-]\d))"[ /]+>\s*)(.*?)(\s*(?:\s*\{\{tsdbr.*?\}\}\s*)*\s*<section end="\2"[ /]+>)', flags=re.DOTALL)
    section_re = re.compile(r'(<section begin="([^"]+)"[^>]+>\s*)(.*?)(\s*<section end="\2"[ /]+>)', flags=re.S | re.I)

    erOnEndWord_re = re.compile(r"""(?<![[<{|/:])  # исключение служ.слов разметки (теги,шаблоны) по спецсимволам в их начале
            (\b(?:[-\ẃˊ]+)\b)  # слово, включая дефис и ударение
            (?!\}    # окончание, исключая слова внутри шаблонов (упрощённо, только в конце перед '}')
              |\.[\s,;{()']*(?:[ёйцукенгшщзхъфывапролджэячсмитьбюѣѵіѳ]|</small|tsdl))""",  # исключая сокращения, по '.'
                                # но из-за этого не обрабатываются последние слова предложений перед точками.
                                flags=re.DOTALL | re.I | re.VERBOSE)
    otherProcessing_re = re.compile(r"(?<![[<{|/:])(\b(?:[-\ẃˊ]+)\b)", flags=re.DOTALL | re.I)

    acut_re = re.compile(r'\{\{акут\}\}', flags=re.I)
    acut3_re = re.compile(r'\{\{акут\}\}', flags=re.I)

    def section_to_do(self, txt):
        sections_original = self.section_re.findall(txt)
        for s in sections_original:
            t = s[2]
            s_original = r'%s%s%s' % (s[0], t, s[3])
            t_new = self.convert(t)
            s_new = r'%s%s%s' % (s[0], t_new, s[3])
            txt = txt.replace(s_original, s_new)
        return txt

    def replace_re(self, w, replace_rules):
        w = w.group(1)
        if w.lower() not in stopwords:
            for s in replace_rules:
                w = re.sub(s[0], s[1], w)
        return w

    def convert(self, t):
        # t = $txt;
        # t = preg_replace("~(\{\{tsd(?:[ls]|br)((?:[-\w|]|\{\{акут\d?\}\}|[́ˊ])+)\}\}|<[^>]+>)~u", '', $txt); // уборка шаблонов и тэгов

        # 	preg_match_all("~(?<!tsdl\||</|<|\{\{)\b((?:[-\w]|\{\{[Аа]кут\d?\}\}|[́ˊ])+)\b(?!\.[\s{(']*(?:[ЁЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮѢѴІѲ]|</small|tsdl))~u", $t, $words, PREG_OFFSET_CAPTURE); // сборка всех слов, кроме сокращений - вычисляются по наличию точки в конце и затем заглавной буквы или конца тэга
        # words = array_unique ($words[1]);
        # 	foreach($words as $w) txt = str_replace($w, converter($w), $txt);
        # t = converter($t);
        # echo $t;

        #  замена {{акут}} на символ ударений, чтобы регуляркам не мешали '{' и много символов
        t = self.acut_re.sub('́', t)
        t = self.acut3_re.sub('ˊ', t)

        #  ъ в конце слов после согласных
        # words = self.erOnEndWord_re.findall(t)
        # for w in words:
        #     for s in replaces_er_postfix:
        #         w = re.sub(s[0], s[1], w)

        t = self.erOnEndWord_re.sub(lambda x: self.replace_re(x, replaces_er_postfix), t)

        #  другая обработка
        # words = self.otherProcessing_re.findall(t)
        # for w in words:
        #     if w.lower() in stopwords:
        #         continue
        #     for s in replaces:
        #         w = re.sub(s[0], s[1], w)

        t = self.otherProcessing_re.sub(lambda x: self.replace_re(x, other_replaces_rules), t)

        # замена ударений на {{акут}}
        t = t.replace('́', '{{акут}}')
        t = t.replace('ˊ', '{{акут3}}')

        return t


if __name__ == '__main__':
    page2DO = ToDO()

    txt = """
    <section begin="Вногу+" reposted />'''Вно{{акут}}гу''' <small>нар.</small> идти нога в но{{акут}}гу, держать одновременный и одномерный шаг с прочими. ''Коли сам-друг несешь что, так иди вногу. Только журавли вногу ходят, да солдаты.''<section end="Вногу+" />

<section begin="Внозить+" reposted />'''Внози{{акут}}ть''', заткнуть, вонзить, занозить, всадить. ''Внозил такую занозу, что насилу ее вытащил. Внозил нож по черен,'' вонзил. Можно <small>уптрб.</small> и ''вножа{{акут}}ть, вна{{акут}}живать'' ипр.<section end="Внозить+" />

<section begin="Внориться+" reposted />'''Вно{{акут}}риться''' где, о животных, изрыть норами и поселиться. ''Тут такая гадина внорилась, еврашки, что хоть не сей хлеба.''<section end="Внориться+" />
    """

    t2 = page2DO.section_to_do(txt)
    pass
